["Russian President Vladimir Putin has signed a law on the establishment of administrative liability for violating the deadline and procedures for payment of goods (works, services) as part of procurement for state and municipal needs.", "This law is meant to solve the very serious issue of customers failing to fulfill their commitments as part of state and municipal procurements.", "Just two years ago, situations in which business owners were unable to collect payment for already-executed state and municipal contracts were widespread.", "At that time, the Russian president tasked the Office of Prosecutor General of the Russian Federation with taking the issue under special control.", "After all, businessmen couldn’t deal on their own with dishonest customers who signed agreements without financial backing, tried their best to get out of assumed payment commitments, and included illegal conditions in agreements.", "The problem was systemic throughout the entire country.", "Since 2015, 9,700 petitions, in the interests of protecting the rights of business owners to receive payment for public contracts, were filed by the Office of the Prosecutor General: according to the results of their investigations, 4,500 officials were subject to disciplinary measures, and 533 were held administratively liable; 75 cases were submitted to the investigative authorities for procedural review, and criminal proceedings were initiated in 46 of them.", "In sum, more than 66 billion rubles worth of debt owed to business owners was repaid.", "Notably, these vast sums were by no means accrued as a result of non-payment of multibillion-ruble contracts.", "Numerous systematic delays in payment for services to business owners for considerably more modest amounts led to these jaw-dropping debts.", "Here is a typical case.", "The head of a small company won a tender for the provision of social transport services worth several million rubles.", "The person invested all of their working capital, fully satisfied their commitments, but didn’t receive the allotted money when it was due.", "The result is an escalating financial snowball comprised of payroll, tax, and loan liabilities, which would have led to bankruptcy if the business owner hadn’t approached the prosecutor’s office for assistance.", "Now, in a number of regions, they have managed to mitigate the problem to the greatest extent possible.", "Nevertheless, as of the first half of 2017, the total amount of debt related to state and municipal contracts, identified by the prosecutors of the constituent entities of the Russian Federation, amounted to approximately 27.4 billion rubles.", "In the regions where debt indicators continue to climb to critical levels, the prosecutor’s office has adopted a hands-on approach to crisis management.", "The prosecutor general is personally holding on-site meetings with local officials, during which they substantively examine all of the violations uncovered by the prosecutors and the measures aimed at their immediate rectification.", "This year, these types of briefing sessions have already taken place in Yaroslavl and Yekaterinburg.", "The realization of Federal Law No. 189-FZ “On amending the Code of the Russian Federation on Administrative Offences in terms of establishing administrative liability for officials of a customer for violating the deadline and procedures for payment of goods (works, services) as part of procurement for state and municipal needs”, which was signed by the Russian president last week, will qualitatively improve the payment discipline of public sector customers.", "The Ministry of Economic Development and Trade of the Russian Federation developed the bill at the request of the Office of the Prosecutor General.", "The new law will add an article to the Code of the Russian Federation on Administrative Offences, which stipulates a penalty of between 30,000 and 50,000 rubles for violation of the deadline and procedures for payment of goods, works, or services as part of state and municipal procurements by an official of a customer.", "However, if the official has already been subject to administrative punishment for a similar offense, then they will be suspended for a period of between one to two years.", "All the prosecutors for the constituent entities of the Russian Federation have already received instructions to enforce the application of these legislative innovations in practice.", "Civil rights group issues travel warning for Missouri", "The National Association for the Advancement of Colored People has put out an alert for people of color traveling to Missouri because of the state's discriminatory policies and racist attacks.", "\"The NAACP Travel Advisory for the state of Missouri, effective through August 28th, 2017, calls for African American travelers, visitors and Missourians to pay special attention and exercise extreme caution when traveling throughout the state given the series of questionable, race-based incidents occurring statewide recently, and noted therein,\" the group's statement reads.", "A recent Missouri law making it harder for people to win discrimination lawsuits, as well as the state's law enforcement disproportionately targeting minorities prompted the group to issue the travel alert, the NAACP said.", "\"You have violations of civil rights that are happening to people.", "They're being pulled over because of their skin color, they're being beaten up or killed,\" the president of the Missouri NAACP, Rod Chapel, told The Kansas City Star.", "\"We are hearing complaints at a rate we haven't heard before.\"", "It is the first such warning that the organization has issued for a state in the US.", "The group cited incidents such as racial slurs against black students at the University of Missouri and the death of Tory Sanders, 28, a black man from Tennessee.", "Sanders died under questionable circumstances earlier this year after he ran out of gas while traveling through the state, and was taken into custody by Missouri police without being accused of a crime.", "The advisory also points to a recent report by the Missouri Attorney General's Office showing that black drivers in the state were 75 percent more likely to be pulled over than whites.", "\"The advisory is for people to be aware, and warn their families and friends and co-workers of what could happen in Missouri,\" Chapel said.", "\"People need to be ready, whether it's bringing bail money with them, or letting relatives know they are traveling through the state.\"", "Missouri recorded 100 hate crimes in 2015, according to the latest figures from the FBI's hate crime reporting program, ranking the state at 16th in the country in terms of the number of such violations.", "The travel warning is also a response to a new Missouri law that would make it more difficult to sue a business for housing or employment discrimination.", "Previously, the American Civil Liberties Union (ACLU) had issued travel advisories for Texas and Arizona after the states passed immigration enforcement laws requiring local law enforcement to detain people on immigration violations which the ACLU said would increase racial profiling.", "Travel warnings are usually issued by the State Department for other countries, but lately, advocacy groups have resorted to the measure in response to certain laws and trends inside the US.", "Two people have died as a result of a shooting of a police patrol in Egypt", "The unidentified individuals shot at a police patrol in the Egyptian city of Esna, Reuters reports with reference to Egypt’s Ministry of Internal Affairs.", "Two people, including one police officer, were killed during the shooting, and three people suffered injuries.", "All the wounded were taken to hospital.", "According to the agency, the police officers stopped a vehicle, at which point the two armed individuals inside of the car opened fire on the law enforcement officials.", "One of the perpetrators has been apprehended, but the second managed to escape.", "The Russian Federal Tourism Agency supports the law eliminating the free baggage allowance for non-refundable airline tickets", "The head of the Russian Federal Tourism Agency, Oleg Safonov, said in an interview with RBK television channel that he is “in favor” of adopting a law eliminating the free baggage allowance for non-refundable airline tickets.", "“We need to establish conditions whereby a person who doesn’t have baggage can purchase a cheaper ticket than a person who has baggage”, he emphasized (quoted by TASS).", "In addition to this, Mr. Safonov noted that, in spite of the concerns of citizens, there would be no need to pay for outerwear or mobile phones in carry-on baggage.", "“It would be right to reassure all our citizens and tourists and to make an announcement about this, to say that this will have nothing to do with outerwear, umbrellas, mobile phones, iPads, or even some computers”, the head of the Russian Federal Tourism Agency said.", "Earlier, Russian President Vladimir Putin signed a law giving airline companies the right to eliminate the free baggage allowance rule on non-refundable airline tickets.", "The point of the issue is that airline companies are free to determine the number of seats and weight of baggage at the non-refundable rate.", "Vladimir Putin has ordered the cleanup of pollution in Baikal", "Russian President Vladimir Putin, at a meeting concerning the protection of Baikal, reported that, over the past several years, significant areas of the lake have been subjected to extreme contamination.", "He instructed that sources of financing, plans, and those responsible for implementing the cleanup of the pollution be identified.", "Mr. Putin also ordered that a full-fledged reclamation of polluted areas be conducted.", "“It is also necessary to deal with the facilities that continue to operate here; the sewage treatment plants, the majority of them are worn-out”, RIA Novosti quotes the president as saying.", "He also added that the Office of the Prosecutor General of the Russian Federation should conduct an inquiry to identify environmentally destructive activities."]